app/controllers/home_controller.rb

SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    p "----------------"
    @project = Project.find(params[:id])